ReFlo/micropython/ports/tm4c123/mods/timer.c
// STATIC mp_obj_t machine_timer_print(mp_obj_t self_in) 
// {
//     mp_hal_stdout_tx_strn("lafft\n\r", 8);
//     // return MP_OBJ_NEW_SMALL_INT(42);
//     return mp_const_none;
// }
// MP_DEFINE_CONST_FUN_OBJ_1(machine_timer_print_obj, machine_timer_print);


// // Beispiel um Funktionen direkt fürs Paket zu hinterlegen
// STATIC mp_obj_t py_subsystem_info(void) {
//     return MP_OBJ_NEW_SMALL_INT(42);
// }
// MP_DEFINE_CONST_FUN_OBJ_0(subsystem_info_obj, py_subsystem_info);


// STATIC void init_timer(mp_obj_t self_in){
//      machine_timer_obj_t *self = (machine_timer_obj_t*) self_in;
     
//      //structure for checking which timer should be initialized
//      //bis jetzt nur TIMER A
//      if(self->timer_id == TIMER_0){
//          self->timer_base = TIMER0_BASE;
//          self->periph = SYSCTL_PERIPH_TIMER0;
//          self->regs = (periph_timer_t*)TIMER0_BASE;
//          self->irqn = INT_TIMER0A;
//      }
//     else if(self->timer_id == TIMER_1){
//          self->timer_base = TIMER1_BASE;
//          self->periph = SYSCTL_PERIPH_TIMER1;
//          self->regs = (periph_timer_t*)TIMER1_BASE;
//          self->irqn = INT_TIMER1A;
//      }
//     else if(self->timer_id == TIMER_2){
//          self->timer_base = TIMER2_BASE;
//          self->periph = SYSCTL_PERIPH_TIMER2;
//          self->regs = (periph_timer_t*)TIMER2_BASE;
//          self->irqn = INT_TIMER2A;
//      }
//     else if(self->timer_id == TIMER_3){
//          self->timer_base = TIMER3_BASE;
//          self->periph = SYSCTL_PERIPH_TIMER3;
//          self->regs = (periph_timer_t*)TIMER3_BASE;
//          self->irqn = INT_TIMER3A;
//      }
//     else if(self->timer_id == TIMER_4){
//          self->timer_base = TIMER4_BASE;
//          self->periph = SYSCTL_PERIPH_TIMER4;
//          self->regs = (periph_timer_t*)TIMER4_BASE;
//          self->irqn = INT_TIMER4A;
//      }
//     else if(self->timer_id == TIMER_5){
//          self->timer_base = TIMER5_BASE;
//          self->periph = SYSCTL_PERIPH_TIMER5;
//          self->regs = (periph_timer_t*)TIMER5_BASE;
//          self->irqn = INT_TIMER5A;
//      }

//     SysCtlPeripheralEnable(self->periph);
//     while(!SysCtlPeripheralReady(self->periph));
//     TimerDisable(self->timer_base,TIMER_A);
//     TimerConfigure(self->timer_base, TIMER_CFG_PERIODIC);   // 32 bits Timer
//     TimerLoadSet(self->timer_base, TIMER_A, 4e+7);
//     // TimerIntRegister(self->timer_base, TIMER_A, TIMER0A_IRQHandler);    // Registering  isr       
//     // TimerEnable(self->timer_base, TIMER_A); 
//     // IntEnable(self->irqn); 
//     // TimerIntEnable(self->timer_base, TIMER_TIMA_TIMEOUT);  
// }

// STATIC mp_obj_t machine_timer_callback(mp_obj_t self_in, mp_obj_t callback) {
// machine_timer_obj_t *self = self_in;
//     if (callback == mp_const_none) {
//         // stop interrupt (but not timer)
//         MAP_TimerIntDisable(TIMER0_BASE,TIMER_TIMA_TIMEOUT);
//         self->callback = mp_const_none;
//     } else if (mp_obj_is_callable(callback)) {
//         MP_STATE_PORT(test_callback_obj)=callback;
//         self->callback = MP_STATE_PORT(test_callback_obj);
//         MAP_TimerIntEnable(TIMER0_BASE,TIMER_TIMA_TIMEOUT);
//     }
//     return mp_const_none;
// }
// STATIC MP_DEFINE_CONST_FUN_OBJ_2(timer_callback_obj, machine_timer_callback);


// void timer_irq_handler(uint tim_id){
// machine_timer_obj_t *self= MP_STATE_PORT(machine_timer_obj_all)[tim_id];
// if(self->timer_id == TIMER_0){
//         TimerIntClear(TIMER0_BASE,TIMER_TIMA_TIMEOUT);
//      }
//     else if(self->timer_id == TIMER_1){
//         TimerIntClear(TIMER1_BASE,TIMER_TIMA_TIMEOUT);
//      }
//     else if(self->timer_id == TIMER_2){
//         TimerIntClear(TIMER2_BASE,TIMER_TIMA_TIMEOUT);
//      }
//     else if(self->timer_id == TIMER_3){
//         TimerIntClear(TIMER3_BASE,TIMER_TIMA_TIMEOUT);
//      }
//     else if(self->timer_id == TIMER_4){
//         TimerIntClear(TIMER4_BASE,TIMER_TIMA_TIMEOUT);
//      }
//     else if(self->timer_id == TIMER_5){
//         TimerIntClear(TIMER5_BASE,TIMER_TIMA_TIMEOUT);
//      }


//     if(self->timer_id){
//         mp_hal_stdout_tx_str("Timer Works!\r\n"); 
//         // mp_sched_lock();
//         // gc_lock();
//         // nlr_buf_t nlr;
//         // if (nlr_push(&nlr) == 0) {

            

//             if(self->callback != mp_const_none){
//             // mp_obj_t callback = self->callback;
//             gc_lock();
//             nlr_buf_t nlr;
//             if (nlr_push(&nlr) == 0) {
//                 mp_call_function_1(MP_STATE_PORT(test_callback_obj), self);
//                 nlr_pop();}
//             }
//         }
//         // mp_call_function_1(self->callback, MP_OBJ_FROM_PTR(self));
//         // self->callback;
    
    
// }

// // Create new Timer object
// mp_obj_t machine_timer_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

//     // check arguments
//     mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
//     // create dynamically new Timer object
//     machine_timer_obj_t *self;

//     timer_id_t timer_id = Timer_find(all_args[0]);
//     // get Timer object
//     if (MP_STATE_PORT(machine_timer_obj_all)[timer_id] == NULL) {

//         self =  m_new0(machine_timer_obj_t, 1);
//         self->base.type = &machine_timer_type;
//         MP_STATE_PORT(machine_timer_obj_all)[timer_id] = self;
//     } else {
//         // reference existing Timer object
//         self = MP_STATE_PORT(machine_timer_obj_all)[timer_id];
//     }
//     self->callback = mp_const_none;

//     //printing test code
//     // mp_obj_print(MP_OBJ_FROM_PTR(all_args[1]), PRINT_STR);

//     //init helper for checking the input args needed
//     //init_helper_timer(self,all_args) bla bla

//     init_timer(self);

//     return MP_OBJ_FROM_PTR(self);

// }


// #####################################################
// Try function from cc32000
// #####################################################

